УчетВУправляющихДляГит1/src/Enums/ВидСчетаФактурыПолученного/ВидСчетаФактурыПолученного.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидСчетаФактурыПолученного</name>
  <comment>Вид полученного счета-фактуры</comment>
  <enumValues>
    <name>НаПоступление</name>
  </enumValues>
  <enumValues>
    <name>НаАванс</name>
  </enumValues>
  <enumValues>
    <name>НаАвансКомитента</name>
  </enumValues>
  <enumValues>
    <name>Корректировочный</name>
  </enumValues>
  <enumValues>
    <name>КорректировочныйНаАванс</name>
  </enumValues>
</mdclass:Enum>

УчетВУправляющихДляГит1/src/Enums/ВидСчетаФактурыПолученного/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает массив значений перечисления, соответствующих авансовому счету-фактуре.
// Возвращаемое значение
//    ВидыСчетовФактурНаАванс - Массив.
Функция СчетаФактурыНаАванс() Экспорт
	
	ВидыСчетовФактурНаАванс = Новый Массив();
	ВидыСчетовФактурНаАванс.Добавить(Перечисления.ВидСчетаФактурыПолученного.НаАванс);
	ВидыСчетовФактурНаАванс.Добавить(Перечисления.ВидСчетаФактурыПолученного.НаАвансКомитента);
	ВидыСчетовФактурНаАванс.Добавить(Перечисления.ВидСчетаФактурыПолученного.КорректировочныйНаАванс);
	
	Возврат ВидыСчетовФактурНаАванс;
	
КонецФункции

#КонецОбласти

#КонецЕсли
